app/controllers/boards_controller.rb

SELECT `boards`.* FROM `boards` WHERE `boards`.`bulletin_id` = 1
---
  def index
    @boards = @bulletin.boards.all

INSERT INTO `boards` (`title`, `content`, `bulletin_id`, `created_at`, `updated_at`) VALUES ('css test', 'test', 2, '2021-04-19 00:12:24', '2021-04-19 00:12:24')
---
  def create
    @board = @bulletin.boards.new(board_params)

    respond_to do |format|
      if @board.save

SELECT  `bulletins`.* FROM `bulletins` WHERE `bulletins`.`id` = 2 LIMIT 1
---
  def set_bulletin
    @bulletin = Bulletin.find(params[:bulletin_id])

SELECT  `boards`.* FROM `boards` WHERE `boards`.`bulletin_id` = 1 AND `boards`.`id` = 1 LIMIT 1
---
    def set_board
      @board = @bulletin.boards.find(params[:id])